---
lab:
  title: '演習 06: Microsoft Sentinel で脅威の捜索を実行する'
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## 演習の概要

あなたは、Microsoft Sentinel を実装した企業で働いているセキュリティ運用アナリストです。 Azure Sentinel を使って脅威を検出および軽減する方法を学習する必要があります。 データ ソースを Microsoft Sentinel に接続した後、環境内の脅威や異常な動作を検出するのに役立つカスタム分析ルールを作成します。

脅威の捜索クエリを使用すると、SOC アナリストは、開発中または着手前に潜在的な攻撃を事前対応的に監視および調査できます。 Microsoft Sentinel 内で捜索を行うと、分析ルールに似たクエリを使用して、悪意のある可能性のあるアクティビティの環境を監査しつつ、アナリストは必要に応じて結果をインシデントにエスカレーションできます。 脅威の捜索では、分析 (高) レベルの保持期間を超えるデータが必要になる場合がありますが、検索/復元ジョブなどの機能を使用して、SOC が必要なデータを確実に所有するようにすることができます。

## 演習の手順

### タスク 1:ハンティング クエリの作成

このタスクでは、捜索クエリを作成し、結果をブックマークします。

1. 管理者として WIN1 仮想マシンにログインします。パスワードは**Pa55w.rd**。  

1. Edge ブラウザーで、Azure portal (<https://portal.azure.com> ) に移動します。

1. **[サインイン]** ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントの電子メール** アカウントをコピーして貼り付け、 **[次へ]** を選択します。

1. **[パスワードの入力]** ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供された**テナントのパスワード**をコピーして貼り付け、 **[サインイン]** を選択します。

1. Azure portal の検索バーに「*Sentinel*」と入力してから、**[Microsoft Sentinel]** を選択します。

1. Microsoft Sentinel ワークスペースを選択します。

1. **[ログ]** を選択します。

1. *[新しいクエリ 1]* スペースに以下の KQL ステートメントを入力します。

   >**重要:** 最初に KQL クエリをメモ帳に貼り付けて、そこから *[新しいクエリ 1]* ログ ウィンドウにコピーしてエラーを回避してください。

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
